; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	spectrograph2 - mode
	thermograph0 - mode
	image3 - mode
	image1 - mode
	image4 - mode
	image6 - mode
	thermograph5 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	GroundStation4 - direction
	GroundStation3 - direction
	GroundStation2 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Planet8 - direction
	Star9 - direction
	Planet10 - direction
	Planet11 - direction
	Planet12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 image4)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 image3)
	(supports instrument1 thermograph0)
	(supports instrument1 thermograph5)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 image6)
	(supports instrument2 image3)
	(supports instrument2 image4)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet13)
	(supports instrument3 image4)
	(supports instrument3 image3)
	(supports instrument3 thermograph0)
	(supports instrument3 image1)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet8)
)
(:goal (and
	(have_image Phenomenon5 thermograph5)
	(have_image Phenomenon5 image3)
	(have_image Phenomenon6 image6)
	(have_image Planet7 image3)
	(have_image Planet8 image4)
	(have_image Planet8 thermograph0)
	(have_image Star9 image1)
	(have_image Star9 spectrograph2)
	(have_image Planet10 image1)
	(have_image Planet11 image6)
	(have_image Planet12 image3)
	(have_image Planet12 spectrograph2)
	(have_image Planet13 image4)
	(have_image Planet13 image6)
))

)

; plan
1. (turn_to satellite1 groundstation2 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 groundstation2)
   goals met: 0 of 14
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 14
3. (calibrate satellite1 instrument3 groundstation2)
   added: (calibrated instrument3)
   goals met: 0 of 14
4. (turn_to satellite1 planet7 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 planet7)
   goals met: 0 of 14
5. (take_image satellite1 planet7 instrument3 image3)
   added: (have_image planet7 image3)
   goals met: 1 of 14
6. (turn_to satellite1 planet12 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 planet12)
   goals met: 1 of 14
7. (take_image satellite1 planet12 instrument3 spectrograph2)
   added: (have_image planet12 spectrograph2)
   goals met: 2 of 14
8. (take_image satellite1 planet12 instrument3 image3)
   added: (have_image planet12 image3)
   goals met: 3 of 14
9. (turn_to satellite1 planet10 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 planet10)
   goals met: 3 of 14
10. (turn_to satellite0 groundstation3 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 groundstation3)
   goals met: 3 of 14
11. (take_image satellite1 planet10 instrument3 image1)
   added: (have_image planet10 image1)
   goals met: 4 of 14
12. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 4 of 14
13. (calibrate satellite0 instrument1 groundstation3)
   added: (calibrated instrument1)
   goals met: 4 of 14
14. (turn_to satellite0 phenomenon5 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 phenomenon5)
   goals met: 4 of 14
15. (take_image satellite0 phenomenon5 instrument1 image3)
   added: (have_image phenomenon5 image3)
   goals met: 5 of 14
16. (take_image satellite0 phenomenon5 instrument1 thermograph5)
   added: (have_image phenomenon5 thermograph5)
   goals met: 6 of 14
17. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 6 of 14
18. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 6 of 14
19. (turn_to satellite0 groundstation2 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 groundstation2)
   goals met: 6 of 14
20. (calibrate satellite0 instrument2 groundstation2)
   added: (calibrated instrument2)
   goals met: 6 of 14
21. (turn_to satellite0 phenomenon6 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon6)
   goals met: 6 of 14
22. (take_image satellite0 phenomenon6 instrument2 image6)
   added: (have_image phenomenon6 image6)
   goals met: 7 of 14
23. (turn_to satellite0 planet11 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 planet11)
   goals met: 7 of 14
24. (take_image satellite0 planet11 instrument2 image6)
   added: (have_image planet11 image6)
   goals met: 8 of 14
25. (turn_to satellite0 planet13 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet13)
   goals met: 8 of 14
26. (take_image satellite0 planet13 instrument2 image4)
   added: (have_image planet13 image4)
   goals met: 9 of 14
27. (take_image satellite0 planet13 instrument2 image6)
   added: (have_image planet13 image6)
   goals met: 10 of 14
28. (turn_to satellite1 planet8 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 planet8)
   goals met: 10 of 14
29. (take_image satellite1 planet8 instrument3 image4)
   added: (have_image planet8 image4)
   goals met: 11 of 14
30. (take_image satellite1 planet8 instrument3 thermograph0)
   added: (have_image planet8 thermograph0)
   goals met: 12 of 14
31. (turn_to satellite1 star9 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star9)
   goals met: 12 of 14
32. (take_image satellite1 star9 instrument3 image1)
   added: (have_image star9 image1)
   goals met: 13 of 14
33. (take_image satellite1 star9 instrument3 spectrograph2)
   added: (have_image star9 spectrograph2)
   goals met: 14 of 14
